Repository: seanpm2001/mt-training-data
Catalog: ts/ts_pontoon.tmx
Source language: en_us
Languages: ts

source: We are building an open and publicly available dataset of voices that everyone can use to train speech-enabled applications.
ts: Hi le ku akeni ka rungula leri pfulekeke no kumeka erivaleni ya marito leyi un’wana na un’wana a nga yi tirhisaka ku letela switirhisiwa leswi pfunaka ku vulavula

source: We are going out to get a coffee.
ts: Hi huma hi ya teka kofi.

source: We are going out to get coffee.
ts: Hi huma hi ya teka kofi.

source: We at Mozilla are building a community around voice technology. We would like to stay in touch with updates, new data sources and to hear more about how you're using this data.
ts: Hina a Mozilla hi le ku akeni ka muganga wa vaaki ku rhendzela thekinoloji ya rito. Hi tsakela ku tshama hi ri eku hlanganiseni na swintshuxo, swihlovo leswintshwa swa datha na ku twa swo tala hi ndlela leyi u tirhisaka datha leyi ha yona.

source: We believe that large and publicly available voice datasets foster innovation and healthy commercial competition in machine-learning based speech technology. This is a global effort and we invite everyone to participate. Our aim is to help speech technology be more inclusive, reflecting the diversity of voices from around the world.
ts: Hi tshemba leswaku tidathaseti ta rito letikulu na leti kumekaka erivaleni ti kurisa vutumbuluxi na mphikizano wa mabindzu lowu hanyeke kahle eka thekinoloji ya mbulavulo leyi simekiweke eka dyondzo ya michini. Leri i matshalatshala ya misava hinkwayo naswona hi rhamba un’wana ni un’wana ku hlanganyela. Xikongomelo xa hina i ku pfuna theknoloji ya mbulavulo ku va yi katsa hinkwavo, ku kombisa ku hambana ka marito ku suka emisaveni hinkwayo.

source: We believe that large, publicly available voice datasets will foster innovation and healthy commercial competition in machine-learning based speech technology. Common Voice’s multi-language dataset is already the largest publicly available voice dataset of its kind, but it’s not the only one. Look to this page as a reference hub for other open source voice datasets and, as Common Voice continues to grow, a home for our release updates.
ts: Hi tshemba leswaku tidathaseti ta rito letikulu, leti kumekaka erivaleni ti ta kurisa vutumbuluxi na mphikizano wa mabindzu lowu hanyeke kahle eka thekinoloji ya mbulavulo leyi simekiweke eka dyondzo ya michini. Dataset ya tindzimi to tala ya Common Voice se i dataset ya rito leyikulu swinene leyi kumekaka erivaleni ya muxaka wa yona, kambe a hi yona ntsena. Languta eka thekinoloji pheji leri tanihi ndhawu ya swikombeto ya tidasete tin’wana ta rito ra xihlovo lexi pfulekeke naswona, tanihi leswi Common Voice yi yaka emahlweni yi kula, kaya ra swintshuxo swa hina swa nkandziyiso.

source: Website Localization
ts: Ku Endla Webusayiti Xikaya

source: We calculate hours by estimating the average length of each recording, and then multiplying that number by the total number of recordings across all languages.
ts: Hi hlaya tiawara hi ku ringanyeta ku leha ka xiringaniso xa rhekhodo yin’wana ni yin’wana, ivi hi andzisa nhlayo yoleyo hi nhlayo hinkwayo ya swilo leswi rhekhodiweke eka tindzimi hinkwato.

source: We could not fetch the stats. Please try again later.
ts: A hi swi kotanga ku teka tinhlayohlayo. Hi kombela u ringeta nakambe endzhaku ka nkarhi.

source: We couldn’t find that page for you
ts: A hi swi kotanga ku ku kumela pheji rero

source: We couldn’t get any audio clips for you to listen to. Please try again later.
ts: A hi swi kotanga ku kuma swiphemu swa mpfumawulo leswaku u ti yingisela. Hi kombela u ringeta nakambe endzhaku ka nkarhi.

source: We couldn’t get any sentences for you to speak. Please try again later.
ts: A hi swi kotanga ku kuma swivulwa swo karhi leswaku u swi vulavula. Hi kombela u ringeta nakambe endzhaku ka nkarhi.

source: Weekly
ts: Vhiki na vhiki

source: Weekly Goal
ts: Pakani ya Vhiki na Vhiki

source: We failed to fetch available languages. Contributions are currently not possible. Please try again later.
ts: Hi tsandzekile ku teka tindzimi leti nga kona. Minyikelo sweswi a yi koteki. Hi kombela u ringeta nakambe endzhaku ka nkarhi.

source: We launch the Common Voice site in this language.
ts: Hi sungula sayiti ya Common Voice hi ririmi leri.

source: Welcome { $company } staff!
ts: Mi amukeriwile vatirhi va{ $company }!

source: Welcome to Common Voice
ts: Mi amukeriwile eka Common Voice

source: Welcome to the Common Voice Sentence Collector
ts: Mi amukeriwile eka Muhlengeleti wa Swivulwa swa Common Voice

source: Welsh
ts: Xi Wales

source: We may not have received that request. Please email us directly on <emailLink>{ $email }</emailLink> and we will get back to you!
ts: Swi nga ha endleka hi nga xi kumanga xikombelo xexo. Hi kombela mi hi rhumela emaiyli hi ku kongoma eka <emailLink>{ $email }</emailLink> naswona hi ta tlhelela eka n’wina!

source: We prefer natural/conversational sentences. While phonetic diversity and different words in sentences is important, we are trying to make recording sentences as much fun as possible. Therefore it would be great if you could try to keep your sentences as natural/engaging as possible.
ts: Hi tsakela swivulwa swa ntumbuluko/swivulwa swa mbulavurisano. Hambileswi ku hambana ka fonetiki na marito yo hambana eka swivulwa swi nga swa nkoka, hi ringeta ku endla leswaku ku rhekhoda swivulwa swi tsakisa hilaha swi nga kotekaka hakona. Hikwalaho swi nga va swinene loko u nga ringeta ku hlayisa swivulwa swa wena swi ri swa ntumbuluko/swi nghenelela hilaha swi nga kotekaka hakona.

source: We promise to handle your information with care. Read more in our <privacyLink>Privacy Notice</privacyLink>.
ts: Hi tshembisa ku khoma rungula ra wena hi vukheta. Hlaya swo tala eka <privacyLink>Xitiviso xa Vuhlayiseki</privacyLink> ya hina.

source: We’re building an open source, multi-language dataset of voices that anyone can use to train speech-enabled applications.
ts: Hi le ku akeni ka xihlovo lexi pfulekeke, rungula ra tindzimi to tala ya marito leyi un’wana na un’wana a nga yi tirhisaka ku letela switirhisiwa leswi pfunaka ku vulavula.

source: We’re crowdsourcing an open-source dataset of voices. Donate your voice, validate the accuracy of other people’s clips, make the dataset better for everyone.
ts: Hi le ku kumeni ka ntshungu eka datasete ya xihlovo lexi pfulekeke xa marito. Nyikela hi rito ra wena, tiyisisa mpakaniso wa titlipi ta vanhu van’wana, endla leswaku datasete yi antswa eka un’wana na un’wana.

source: We’re experiencing unexpected downtime
ts: Hi hlangene na nkarhi wo yima lowu nga languteriwangiki

source: We’re going out to get coffee.
ts: Hi huma hi ya teka kofi.

source: We release the dataset every 3 months.
ts: Hi humesa datasete endzhaku ka tin’hweti tinharhu 3 tin’wana na tin’wana.

source: We're receiving a lot of traffic and are currently investigating the issues.
ts: Hi kuma ntlimbano yo tala naswona sweswi hi le ku lavisiseni ka timhaka leti.

source: We’re sorry, your platform is not currently supported.
ts: Hi n’wi rivaleli,pulatifomo ya wena a yi seketeriwi sweswi.

source: We use a Mozilla tool called <pontoonLink>Pontoon</pontoonLink> for translations. Pontoon has lots of languages, but if it doesn’t have yours you can <pontoonRequestLink>request for your language to be added</pontoonRequestLink>. Then, to make the language available on the Common Voice project, <githubRepoLink>request the new language on GitHub</githubRepoLink>. <localizationFragment>See more on site translation</localizationFragment>.
ts: Hi tirhisa xitirhisiwa xa Mozilla lexi vuriwaka <pontoonLink>Pontoon</pontoonLink> eka vuhundzuluxeri. Pontoon yi na tindzimi to tala, . kambe loko yi nga ri na ya wena u nga <pontoonRequestLink>ku kombela leswaku ririmi ra wena ri engeteriwa</pontoonRequestLink>. Kutani, ku endla leswaku ririmi ri kumeka eka phurojeke ya Common Voice, . <githubRepoLink>kombela ririmi lerintshwa eka GitHub</githubRepoLink>. <localizationFragment>Vona swo tala eka vuhundzuluxi bya sayiti</localizationFragment>.

source: We've run out of clips to validate in this language...
ts: Hi heleriwe hi swiphemu ku tiyisisa hi ririmi leri...

source: We've run out of sentences to record in this language...
ts: Hi heleriwe hi swivulwa swo rhekhoda hi ririmi leri...

source: We want speech models to be better at understanding a diverse range of speakers. For this to happen, a voice dataset must represent lots of different people.
ts: Hi lava leswaku swikombiso swa mbulavulo swi antswa eku twisiseni ka swivulavuri swo hambana-hambana. Leswaku leswi swi humelela, dataset ya rito yi fanele ku yimela vanhu vo tala vo hambana.

source: We want the Common Voice dataset to reflect the audio quality a speech-to-text engine will hear in the wild, so we’re looking for variety. In addition to a diverse community of speakers, a dataset with varying audio quality will teach the speech-to-text engine to handle various real-world situations, from background talking to car noise. As long as your voice clip is intelligible, it should be good enough for the dataset.
ts: Hi lava leswaku dataset ya Common Voice yi kombisa khwalithi ya mpfumawulo leyi injhini ya mbulavulo ku ya eka tsalwa yi nga ta yi twa ekhwatini, hikwalaho hi lava ku hambana-hambana. Ku engetela eka ntlawa wo hambana-hambana wa swipikara, dataset leyi nga ni khwalithi yo hambana-hambana ya mpfumawulo yi ta dyondzisa injhini ya mbulavulo ku ya eka tsalwa ku khoma swiyimo swo hambana-hambana swa xiviri, ku sukela eka ku vulavula endzhaku ku ya eka mpfumawulo wa movha. Loko ntsena xiphemu xa wena xa rito xi twisiseka, xi fanele xi va lexinene ku ringana eka dataset.

source: We want the machine learning algorithms to able to handle a variety of background noise, and even relatively loud noises can be accepted provided that they don’t prevent you from hearing the entirety of the text. Quiet background music is OK; music loud enough to prevent you from hearing each and every word is not.
ts: Hi lava leswaku tialgorithm to dyondza hi muchini ti kota ku khoma mpfumawulo wo hambana-hambana wa le ndzhaku, naswona hambi ku ri mimpfumawulo leyi tlakukeke swinene yi nga amukeriwa ntsena loko yi nga ku siveli ku twa tsalwa hinkwaro. Vuyimbeleri bya le ndzhaku lebyi rhuleke byi lulamile; vuyimbeleri lebyi tlakukeke lerova byi ku sivela ku twa rito rin’wana ni rin’wana a hi rona.

source: We will also <strong>let our community manager know that you’re interested</strong>, so they can give you any extra support or information you might need.
ts: Hi ta tlhela <strong>hi tivisa mufambisi wa muganga wa ka hina leswaku wa swi tsakela</strong>, kutani va swi kota ku nyika nseketelo lowu engetelekeke kumbe vuxokoxoko lebyi u nga ha byi lavaka.

source: We will be in touch with more information about how to add your language to Common Voice very soon.
ts: Hi ta tihlanganisa na vuxokoxoko byo tala mayelana na ndlela yo engetela ririmi ra wena eka Common Voice ku nga ri khale swinene.

source: We will be in touch with more information as it becomes available.
ts: Hi ta tihlanganisa na vuxokoxoko byo tala loko byi ri karhi byi kumeka.

source: We will not make your email public.
ts: A hi nge endli imeyili ya wena yi humela erivaleni.

source: We will review your request to remove your voice recordings from the dataset. If your request is approved, we will contact those who have downloaded the dataset and request they remove your voice recordings as well.
ts: Hi ta kambisisa xikombelo xa wena xo susa tirhekhodo ta wena ta rito eka dataset. Loko xikombelo xa wena xi amukeriwile, hi ta tihlanganisa na lava va nga kopa dataset hi kombela leswaku va susa swi rhekhodo swa wena swa rito na swona.

source: What does it mean that I can’t “determine the identity” of speakers in the Common Voice dataset?
ts: Xana swi vula yini leswaku a ndzi swi koti ku “kumisisa vutivi” bya swivulavuri eka rungula ra Common Voice?

source: What is a language on Common Voice?
ts: Xana ririmi eka Common Voice i yini?

source: What is Common Voice?
ts: Xana Common Voice i yini?

source: What issues are you experiencing with this sentence?
ts: Hi tihi timhaka leti u langutanaka na tona hi xivulwa lexi?

source: What kind of goal do you want to build?
ts: Xana u lava ku aka pakani ya njhani?

source: What level of audio quality is required for a voice clip to be used in the dataset?
ts: Xana i xiyimo xihi xa khwalithi ya mpfumawulo lexi lavekaka leswaku xiphemu xa rito xi tirhisiwa eka rungula?

source: What’s inside the Common Voice dataset?
ts: I yini lexi nga endzeni ka dataset ya Common Voice?

source: What's Public?
ts: Xana i yini lexi nga erivaleni?

source: What’s the difference between Common Voice and Deep Speech?
ts: Xana ku hambana kwihi exikarhi ka Common Voice na Deep Speech?

source: When a user rejects a voice clip it returns to the Queue. If rejected a second time, the voice clip is moved to the Clip Graveyard.
ts: Loko mutirhisi a ala xiphemu xa rito xi tlhelela eka Fole. Loko xi ariwa ra vumbirhi, xiphemu xa rito xi yisiwa eSirheni ra Xiphemu.

source: When listening, check very carefully that what has been recorded is exactly what has been written; reject if there are even minor errors. <br />Very common mistakes include:
ts: Loko u yingisela, kambela hi vukheta swinene leswaku leswi swi nga rhekhodiwa hi swona leswi nga tsariwa; ala loko ku ri ni hambi ku ri na swihoxo leswitsongo. <br />Swihoxo leswi tolovelekeke swinene swi katsa:

source: When will you release Common Voice data in other languages?
ts: Xana u ta humesa rini rungula ra Common Voice hi tindzimi tin’wana?

source: When you request your recordings, we compile them into one or multiple ZIP files. Here are your past requests:
ts: Loko u kombela tirhekhodo ta wena, hi ti hlengeleta ti va fayili yin’we kumbe to tala ta ZIP. Hi leswi swikombelo swa wena swa nkarhi lowu hundzeke:

source: Where are these <wikipediaLink>public domain</wikipediaLink> sentences from?
ts: Xana swivulwa leswi swa <wikipediaLink>ndhawu ya mani na mani</wikipediaLink> swi huma kwihi?

source: Where does the source text come from?
ts: Xana tsalwa ra xihlovo ri huma kwihi?

source: Which variant of { $language } do you speak?
ts: Hi yihi muxaka wa { $language } lowu u wu vulavulaka?

source: Why ?
ts: Hikokwalaho ka yini ?

source: Why a profile?
ts: Ha yini ku ri ni phurofayili?

source: Why Common Voice?
ts: Hikokwalaho ka yini Common Voice?

source: Why does this matter?
ts: Hi yini leswi swi ri na mhaka?

source: Why don’t you ask people to read from books or Wikipedia articles in different languages?
ts: Ha yini u nga kombeli vanhu ku hlaya eka tibuku kumbe swihloko swa Wikipedia hi tindzimi to hambana-hambana?

source: Why do you need so many different speakers per language?
ts: Hi yini u lava swivulavuri swo tala swo hambana-hambana hi ririmi?

source: Why is 10,000 validated hours the per language goal for capturing audio?
ts: Hi yini tiawara ta 10 000 leti tiyisisiweke ti ri pakani ya ririmi rin’wana ni rin’wana ro teka mpfumawulo?

source: Why is Common Voice part of the Mozilla mission?
ts: Ha yini Common Voice yi ri xiphemu xa vurhumiwa bya Mozilla?

source: Why is it important?
ts: Ha yini swi ri swa nkoka?

source: Why is my language not included yet?
ts: Ha yini ririmi ra mina ri nga si katsiwa?

source: Why should I sign up for an account?
ts: Ha yini ndzi fanele ndzi tsarisa eka akhawunti?

source: Would you like to request your voice recordings be deleted too, or do you prefer to keep them in the Common Voice dataset?
ts: Xana u nga tsakela ku kombela leswaku swi rhekhodo swa wena swa rito na swona swi susiwa, kumbe u tsakela ku swi hlayisa eka dataset ya Common Voice?

source: Xhosa
ts: Xixhosa

source: Yes
ts: Ina

source: Yes, send me emails. I’d like to stay informed about the Common Voice Project.
ts: Ina, ndzi rhumeleni ti-imeyili. Ndzi tsakela ku tshama ndzi ri karhi ndzi tivisiwa hi tsima ra Common Voice.

source: Yes, send me emails. I'd like to stay informed about the progress of this language on Common Voice.
ts: Ina, ndzi rhumeleni ti-email. Ndzi tsakela ku tshama ndzi ri karhi ndzi tivisiwa hi nhluvuko wa ririmi leri eka Common Voice.

source: Yes, we especially want your voice! Part of the aim of Common Voice is to gather as many different accents as possible so that voice recognition services work equally well for everyone. This means donations from non-native speakers are particularly important.
ts: Ina, ngopfu-ngopfu hi lava rito ra wena! Xiphemu xa xikongomelo xa Common Voice i ku hlengeleta swichayachayana swo tala swo hambana hilaha swi nga kotekaka hakona leswaku vukorhokeri byo tiva rito byi tirha kahle hi ku ringana eka un’wana na un’wana. Leswi swi vula leswaku minyikelo leyi humaka eka lava nga vulavuriki ririmi ra rikwavo i ya nkoka swinene.

source: Yiddish
ts: Xiyidixi

source: Yoruba
ts: Xiyoruba

source: You
ts: Wena

source: You are about to initiate a download of <size>{ $size }GB</size>, proceed?
ts: U le kusuhi no sungula ku dawuniloda ka <size>{ $size }GB</size>, yana emahlweni?

source: You are prepared to initiate a download of <b>{ $size }</b>
ts: U lulamerile ku sungula ku dawuniloda ka <b>{ $size }</b>

source: You can also copy and paste the direct URLs into your favorite download manager. They will expire in 12 hours, but you can come back to this page to generate new ones any time.
ts: U nga ha tlhela u kopa ni ku namarheta ti-URL leti kongomeke eka mufambisi wa wena wo kopa lowu u wu tsakelaka. Ti ta hela endzhaku ka tiawara ta 12, kambe u nga vuya eka tluka leri ku humesa letintshwa nkarhi wihi na wihi.

source: You can also use Keyboard Shortcuts: { sc-review-form-button-approve-shortcut } to Approve, { sc-review-form-button-reject-shortcut } to Reject, { sc-review-form-button-skip-shortcut } to Skip
ts: { sc-review-form-button-skip-shortcut }{ sc-review-form-button-skip-shortcut }U nga ha tlhela u tirhisa Swipfuxeto swa Khibhodi: { sc-review-form-button-approve-shortcut } ku Pfumelela, { sc-review-form-button-reject-shortcut } ku Ala, { sc-review-form-button-reject-shortcut } ku ya eka Tlula{ sc-review-form-button-skip-shortcut }

source: You can choose to make your username public or anonymous.
ts: U nga hlawula ku endla vito ra wena ra mutirhisi ri va ra mani na mani kumbe ri nga tiviwi.

source: You can go to the <datasetsPage>datasets page</datasetsPage>, select the version and language(s) you want, and download it! The files have <metadataLink>associated metadata</metadataLink>, such as demographic information and validation data. You’ll need to provide an email address to download the dataset.
ts: U nga ya eka <datasetsPage>pheji ya ti-dataset</datasetsPage>, u hlawula vuhundzuluxeri ni ririmi leri u ri lavaka, ivi u ri kopa! Tifayili ti na <metadataLink>metadata leyi fambelanaka na yona</metadataLink>, ku fana na vuxokoxoko bya nhlayo ya vaaki na datha ya ku tiyisisa. U ta lava ku nyika adirese ya imeyili ku ri u ta kota ku kopa dataset.

source: You can help build a diverse, open-source dataset by creating a Common Voice profile and contributing your voice.
ts: U nga pfuneta ku aka rungula ro hambana, ra xihlovo lexi pfulekeke hi ku tumbuluxa phurofayili ya Common Voice na ku hoxa xandla hi rito ra wena.

source: You can meet others in the Mozilla language communities by joining <discourseLink>Discourse</discourseLink> for topical conversations, or <matrixLink>Matrix</matrixLink> for quick advice.
ts: U nga hlangana ni van’wana ematikweni ya ririmi ya Mozilla hi ku tihlanganisa ni<discourseLink>Discourse</discourseLink>eka tinhloko-mhaka to vulavurisana, kumbe <matrixLink>Matrix</matrixLink> ya xitsundzuxo hi xihatla.

source: You cannot request your recordings while another request is already in progress.
ts: A wu nge kombeli swi rhekhodo swa wena loko xikombelo xin’wana se xi ri karhi xi endliwa.

source: You can request a new takeout of your recordings every { $days } days.
ts: U nga kombela ku tekiwa lokuntshwa ka tirhekhodo ta wena endzhaku ka masiku man’wana na man’wana ya { $days }.

source: You can run events to help people contribute. It’s easier than you think. You could do it online with a videoconferencing tool, or in person if it’s safe. <eventTemplate>Check out our templates and resources for running events</eventTemplate>.
ts: U nga fambisa swiendlakalo ku pfuna vanhu ku hoxa xandla. Swi olova ku tlula leswi u swi ehleketaka. U nga swi endla eka inthanete hi xitirhisiwa xa ku endliwa ka tivhidiyo kumbe hi xiviri loko swi hlayisekile. <eventTemplate>Languta tithempleyiti ta hina na switirhisiwa swo fambisa swiendlakalo</eventTemplate>.

source: You can <sentenceCollectorLinkAdd>add small numbers of sentences</sentenceCollectorLinkAdd>, or you can do <bulkImportDocsLink>bulk imports using Github</bulkImportDocsLink>. Remember that sentences need to be <licenseLink>CC0 (or public domain)</licenseLink>, or you can write your own.
ts: U nga <sentenceCollectorLinkAdd>engetela tinomboro letitsongo ta swivulwa</sentenceCollectorLinkAdd>, . kumbe u nga endla <bulkImportDocsLink>ku nghenisa hi xitalo hi ku tirhisa Github</bulkImportDocsLink>. Tsundzuka leswaku swivulwa swi lava ku va <licenseLink>CC0 (kumbe domeyini ya mani kumbe mani)</licenseLink>, kutani u nga tsala swa wena.

source: You can use the <scraperLink>Sentence extractor</scraperLink> to leverage short sentences from Wikipedia.
ts: U nga tirhisa leswi <scraperLink>Xihlamusela-marito xa xivulwa</scraperLink> ku tirhisa swivulwa swo koma ku suka eka Wikipedia.

source: You could include the website, e.g "Common Voice - https://commonvoice.mozilla.org/"
ts: U nga katsa webusayiti, e.g "Common Voice - https://commonvoice.mozilla.org/"

source: You could use academic referencing style, e.g Harvard style "Mozilla (2021) Common Voice. Available at https://commonvoice.mozilla.org/ (Accessed: 15th September 2021)"
ts: U nga tirhisa endlelo ra dyondzo ro kombetela, hi xikombiso, endlelo ra Harvard "Mozilla (2021) Common Voice. Yi kumeka eka https://commonvoice.mozilla.org/ (Accessed: 15th September 2021)"

source: You could use social media platforms to get the message out. Share posts that explain why it matters, and get in touch with other people talking about issues like language rights, voice AI, or bias in tech. See more advice on <campaignLink>running a social campaign, including content you can re-use</campaignLink>.
ts: U nga tirhisa tipulatifomo ta ti-website to endla xinghana ku humesa rungula. Avelana ti post leti hlamuselaka leswaku hikokwalaho ka yini swi ri swa nkoka, naswona u tihlanganisa na vanhu van’wana va vulavula hi timhaka to fana na timfanelo ta ririmi, AI ya rito, kumbe xihlawuhlawu eka theknoloji. Vona switsundzuxo swin’wana eka <campaignLink>ku fambisa pfhumba ra swa ntshamisano, ku katsa na swilo leswi u nga swi tirhisaka nakambe</campaignLink>.

source: You have not added any languages yet.
ts: A wu si engetela tindzimi tihi na tihi.

source: You have not selected any languages. Please go to your <profileLink>Profile</profileLink> to select languages.
ts: A wu hlawulanga tindzimi tihi na tihi. Ndzi kombela u ya eka <profileLink>Phurofayili</profileLink ya wena ku hlawula tindzimi.

source: You must allow microphone access.
ts: U fanele u pfumelela ku nghena eka microphone.

source: You previously skipped sentences while reviewing. Resetting skipped sentences will show all skipped sentences again. This is independent of the language.
ts: U tlule swivulwa enkarhini lowu nga hundza loko u karhi u kambisisa. Ku tlhentlhisa swivulwa u nga swi tlula ku ta kombisa swivulwa leswi u nga swi tlula hinkwaso nakambe. Leswi swi na vutilawuri eka ririmi.
